==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
Sequential                               [10, 1]                   --
├─Sequential: 1-1                        [10, 1024]                --
│    └─Linear: 2-1                       [10, 512]                 169,472
│    └─ReLU: 2-2                         [10, 512]                 --
│    └─Linear: 2-3                       [10, 1024]                525,312
│    └─ReLU: 2-4                         [10, 1024]                --
├─DenseBlock: 1-2                        [10, 1280]                --
│    └─Sequential: 2-5                   --                        --
│    │    └─Sequential: 3-1              [10, 128]                 131,456
│    │    └─Sequential: 3-2              [10, 128]                 147,840
├─Sequential: 1-3                        [10, 640]                 --
│    └─Linear: 2-6                       [10, 640]                 819,840
│    └─BatchNorm1d: 2-7                  [10, 640]                 1,280
│    └─ReLU: 2-8                         [10, 640]                 --
├─DenseBlock: 1-4                        [10, 896]                 --
│    └─Sequential: 2-9                   --                        --
│    │    └─Sequential: 3-3              [10, 128]                 82,304
│    │    └─Sequential: 3-4              [10, 128]                 98,688
├─Sequential: 1-5                        [10, 448]                 --
│    └─Linear: 2-10                      [10, 448]                 401,856
│    └─BatchNorm1d: 2-11                 [10, 448]                 896
│    └─ReLU: 2-12                        [10, 448]                 --
├─DenseBlock: 1-6                        [10, 704]                 --
│    └─Sequential: 2-13                  --                        --
│    │    └─Sequential: 3-5              [10, 128]                 57,728
│    │    └─Sequential: 3-6              [10, 128]                 74,112
├─Sequential: 1-7                        [10, 352]                 --
│    └─Linear: 2-14                      [10, 352]                 248,160
│    └─BatchNorm1d: 2-15                 [10, 352]                 704
│    └─ReLU: 2-16                        [10, 352]                 --
├─DenseBlock: 1-8                        [10, 608]                 --
│    └─Sequential: 2-17                  --                        --
│    │    └─Sequential: 3-7              [10, 128]                 45,440
│    │    └─Sequential: 3-8              [10, 128]                 61,824
├─BatchNorm1d: 1-9                       [10, 608]                 1,216
├─ReLU: 1-10                             [10, 608]                 --
├─Linear: 1-11                           [10, 1]                   609
==========================================================================================
Total params: 2,868,737
Trainable params: 2,868,737
Non-trainable params: 0
Total mult-adds (M): 28.69
==========================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 0.57
Params size (MB): 11.47
Estimated Total Size (MB): 12.05
==========================================================================================

k, num_epochs, lr, weight_decay, batch_size = (5, 30, 1, 30, 128) 

training on cuda:0
3.1 sec
折1，训练log rmse0.103148, 验证log rmse0.126370
2.9 sec
折2，训练log rmse0.087984, 验证log rmse0.150475
2.9 sec
折3，训练log rmse0.056061, 验证log rmse0.117273
2.9 sec
折4，训练log rmse0.043516, 验证log rmse0.098603
2.9 sec
折5，训练log rmse0.084914, 验证log rmse0.123268
5-折验证: 平均训练log rmse: 0.075125, 平均验证log rmse: 0.123198
3.3 sec
训练log rmse：0.051300
