==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
Sequential                               [10, 10]                  --
├─Sequential: 1-1                        [10, 64, 24, 24]          --
│    └─Conv2d: 2-1                       [10, 64, 48, 48]          3,200
│    └─BatchNorm2d: 2-2                  [10, 64, 48, 48]          128
│    └─ReLU: 2-3                         [10, 64, 48, 48]          --
│    └─MaxPool2d: 2-4                    [10, 64, 24, 24]          --
├─DenseBlock: 1-2                        [10, 192, 24, 24]         --
│    └─Sequential: 2-5                   --                        --
│    │    └─Sequential: 3-1              [10, 32, 24, 24]          18,592
│    │    └─Sequential: 3-2              [10, 32, 24, 24]          27,872
│    │    └─Sequential: 3-3              [10, 32, 24, 24]          37,152
│    │    └─Sequential: 3-4              [10, 32, 24, 24]          46,432
├─Sequential: 1-3                        [10, 96, 12, 12]          --
│    └─BatchNorm2d: 2-6                  [10, 192, 24, 24]         384
│    └─ReLU: 2-7                         [10, 192, 24, 24]         --
│    └─Conv2d: 2-8                       [10, 96, 24, 24]          18,528
│    └─AvgPool2d: 2-9                    [10, 96, 12, 12]          --
├─DenseBlock: 1-4                        [10, 224, 12, 12]         --
│    └─Sequential: 2-10                  --                        --
│    │    └─Sequential: 3-5              [10, 32, 12, 12]          27,872
│    │    └─Sequential: 3-6              [10, 32, 12, 12]          37,152
│    │    └─Sequential: 3-7              [10, 32, 12, 12]          46,432
│    │    └─Sequential: 3-8              [10, 32, 12, 12]          55,712
├─Sequential: 1-5                        [10, 112, 6, 6]           --
│    └─BatchNorm2d: 2-11                 [10, 224, 12, 12]         448
│    └─ReLU: 2-12                        [10, 224, 12, 12]         --
│    └─Conv2d: 2-13                      [10, 112, 12, 12]         25,200
│    └─AvgPool2d: 2-14                   [10, 112, 6, 6]           --
├─DenseBlock: 1-6                        [10, 240, 6, 6]           --
│    └─Sequential: 2-15                  --                        --
│    │    └─Sequential: 3-9              [10, 32, 6, 6]            32,512
│    │    └─Sequential: 3-10             [10, 32, 6, 6]            41,792
│    │    └─Sequential: 3-11             [10, 32, 6, 6]            51,072
│    │    └─Sequential: 3-12             [10, 32, 6, 6]            60,352
├─Sequential: 1-7                        [10, 120, 3, 3]           --
│    └─BatchNorm2d: 2-16                 [10, 240, 6, 6]           480
│    └─ReLU: 2-17                        [10, 240, 6, 6]           --
│    └─Conv2d: 2-18                      [10, 120, 6, 6]           28,920
│    └─AvgPool2d: 2-19                   [10, 120, 3, 3]           --
├─DenseBlock: 1-8                        [10, 248, 3, 3]           --
│    └─Sequential: 2-20                  --                        --
│    │    └─Sequential: 3-13             [10, 32, 3, 3]            34,832
│    │    └─Sequential: 3-14             [10, 32, 3, 3]            44,112
│    │    └─Sequential: 3-15             [10, 32, 3, 3]            53,392
│    │    └─Sequential: 3-16             [10, 32, 3, 3]            62,672
├─BatchNorm2d: 1-9                       [10, 248, 3, 3]           496
├─ReLU: 1-10                             [10, 248, 3, 3]           --
├─AdaptiveAvgPool2d: 1-11                [10, 248, 1, 1]           --
├─Flatten: 1-12                          [10, 248]                 --
├─Linear: 1-13                           [10, 10]                  2,490
==========================================================================================
Total params: 758,226
Trainable params: 758,226
Non-trainable params: 0
Total mult-adds (G): 1.29
==========================================================================================
Input size (MB): 0.37
Forward/backward pass size (MB): 79.39
Params size (MB): 3.03
Estimated Total Size (MB): 82.79
==========================================================================================
Sequential output shape:	 torch.Size([10, 64, 24, 24])
DenseBlock output shape:	 torch.Size([10, 192, 24, 24])
Sequential output shape:	 torch.Size([10, 96, 12, 12])
DenseBlock output shape:	 torch.Size([10, 224, 12, 12])
Sequential output shape:	 torch.Size([10, 112, 6, 6])
DenseBlock output shape:	 torch.Size([10, 240, 6, 6])
Sequential output shape:	 torch.Size([10, 120, 3, 3])
DenseBlock output shape:	 torch.Size([10, 248, 3, 3])
BatchNorm2d output shape:	 torch.Size([10, 248, 3, 3])
ReLU output shape:	 torch.Size([10, 248, 3, 3])
AdaptiveAvgPool2d output shape:	 torch.Size([10, 248, 1, 1])
Flatten output shape:	 torch.Size([10, 248])
Linear output shape:	 torch.Size([10, 10])

learning_rate = 0.1, num_epochs = 10, batch_size = 128

training on cuda:0
12.3 sec, [epoch: 0] train_loss: 0.449, train_acc: 0.838, test_acc: 0.843
24.4 sec, [epoch: 1] train_loss: 0.273, train_acc: 0.901, test_acc: 0.893
36.6 sec, [epoch: 2] train_loss: 0.232, train_acc: 0.915, test_acc: 0.904
48.8 sec, [epoch: 3] train_loss: 0.207, train_acc: 0.923, test_acc: 0.902
60.9 sec, [epoch: 4] train_loss: 0.190, train_acc: 0.930, test_acc: 0.908
73.1 sec, [epoch: 5] train_loss: 0.172, train_acc: 0.937, test_acc: 0.904
85.2 sec, [epoch: 6] train_loss: 0.158, train_acc: 0.942, test_acc: 0.919
97.3 sec, [epoch: 7] train_loss: 0.148, train_acc: 0.945, test_acc: 0.893
109.5 sec, [epoch: 8] train_loss: 0.136, train_acc: 0.950, test_acc: 0.911
121.6 sec, [epoch: 9] train_loss: 0.125, train_acc: 0.954, test_acc: 0.908
[Total] loss 0.125, train acc 0.954,test acc 0.908
[Total] 121.6 sec, 4934.2 examples/secon cuda:0
