==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
Sequential                               [10, 1]                   --
├─Sequential: 1-1                        [10, 1024]                --
│    └─Linear: 2-1                       [10, 512]                 169,472
│    └─ReLU: 2-2                         [10, 512]                 --
│    └─Linear: 2-3                       [10, 1024]                525,312
│    └─ReLU: 2-4                         [10, 1024]                --
├─DenseBlock: 1-2                        [10, 1280]                --
│    └─Sequential: 2-5                   --                        --
│    │    └─Sequential: 3-1              [10, 128]                 131,456
│    │    └─Sequential: 3-2              [10, 128]                 147,840
├─Sequential: 1-3                        [10, 640]                 --
│    └─Linear: 2-6                       [10, 640]                 819,840
│    └─BatchNorm1d: 2-7                  [10, 640]                 1,280
│    └─ReLU: 2-8                         [10, 640]                 --
├─DenseBlock: 1-4                        [10, 896]                 --
│    └─Sequential: 2-9                   --                        --
│    │    └─Sequential: 3-3              [10, 128]                 82,304
│    │    └─Sequential: 3-4              [10, 128]                 98,688
├─BatchNorm1d: 1-5                       [10, 896]                 1,792
├─ReLU: 1-6                              [10, 896]                 --
├─Linear: 1-7                            [10, 1]                   897
==========================================================================================
Total params: 1,978,881
Trainable params: 1,978,881
Non-trainable params: 0
Total mult-adds (M): 19.79
==========================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 0.38
Params size (MB): 7.92
Estimated Total Size (MB): 8.31
==========================================================================================

k, num_epochs, lr, weight_decay, batch_size = (5, 10, 0.5, 10, 64) 

training on cuda:0
1.1 sec
折1，训练log rmse0.109808, 验证log rmse0.122605
0.9 sec
折2，训练log rmse0.082875, 验证log rmse0.123539
0.9 sec
折3，训练log rmse0.077870, 验证log rmse0.106655
0.9 sec
折4，训练log rmse0.069377, 验证log rmse0.099208
0.9 sec
折5，训练log rmse0.076908, 验证log rmse0.097882
5-折验证: 平均训练log rmse: 0.083368, 平均验证log rmse: 0.109978
1.1 sec
训练log rmse：0.137482
