Sequential output shape:	 torch.Size([1, 64, 24, 24])
Sequential output shape:	 torch.Size([1, 192, 12, 12])
Sequential output shape:	 torch.Size([1, 480, 6, 6])
Sequential output shape:	 torch.Size([1, 832, 3, 3])
Sequential output shape:	 torch.Size([1, 1024])
Linear output shape:	 torch.Size([1, 10])
==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
Sequential                               [1, 10]                   --
├─Sequential: 1-1                        [1, 64, 24, 24]           --
│    └─Conv2d: 2-1                       [1, 64, 48, 48]           3,200
│    └─ReLU: 2-2                         [1, 64, 48, 48]           --
│    └─MaxPool2d: 2-3                    [1, 64, 24, 24]           --
├─Sequential: 1-2                        [1, 192, 12, 12]          --
│    └─Conv2d: 2-4                       [1, 64, 24, 24]           4,160
│    └─ReLU: 2-5                         [1, 64, 24, 24]           --
│    └─Conv2d: 2-6                       [1, 192, 24, 24]          110,784
│    └─ReLU: 2-7                         [1, 192, 24, 24]          --
│    └─MaxPool2d: 2-8                    [1, 192, 12, 12]          --
├─Sequential: 1-3                        [1, 480, 6, 6]            --
│    └─Inception: 2-9                    [1, 256, 12, 12]          --
│    │    └─Conv2d: 3-1                  [1, 64, 12, 12]           12,352
│    │    └─Conv2d: 3-2                  [1, 96, 12, 12]           18,528
│    │    └─Conv2d: 3-3                  [1, 128, 12, 12]          110,720
│    │    └─Conv2d: 3-4                  [1, 16, 12, 12]           3,088
│    │    └─Conv2d: 3-5                  [1, 32, 12, 12]           12,832
│    │    └─MaxPool2d: 3-6               [1, 192, 12, 12]          --
│    │    └─Conv2d: 3-7                  [1, 32, 12, 12]           6,176
│    └─Inception: 2-10                   [1, 480, 12, 12]          --
│    │    └─Conv2d: 3-8                  [1, 128, 12, 12]          32,896
│    │    └─Conv2d: 3-9                  [1, 128, 12, 12]          32,896
│    │    └─Conv2d: 3-10                 [1, 192, 12, 12]          221,376
│    │    └─Conv2d: 3-11                 [1, 32, 12, 12]           8,224
│    │    └─Conv2d: 3-12                 [1, 96, 12, 12]           76,896
│    │    └─MaxPool2d: 3-13              [1, 256, 12, 12]          --
│    │    └─Conv2d: 3-14                 [1, 64, 12, 12]           16,448
│    └─MaxPool2d: 2-11                   [1, 480, 6, 6]            --
├─Sequential: 1-4                        [1, 832, 3, 3]            --
│    └─Inception: 2-12                   [1, 512, 6, 6]            --
│    │    └─Conv2d: 3-15                 [1, 192, 6, 6]            92,352
│    │    └─Conv2d: 3-16                 [1, 96, 6, 6]             46,176
│    │    └─Conv2d: 3-17                 [1, 208, 6, 6]            179,920
│    │    └─Conv2d: 3-18                 [1, 16, 6, 6]             7,696
│    │    └─Conv2d: 3-19                 [1, 48, 6, 6]             19,248
│    │    └─MaxPool2d: 3-20              [1, 480, 6, 6]            --
│    │    └─Conv2d: 3-21                 [1, 64, 6, 6]             30,784
│    └─Inception: 2-13                   [1, 512, 6, 6]            --
│    │    └─Conv2d: 3-22                 [1, 160, 6, 6]            82,080
│    │    └─Conv2d: 3-23                 [1, 112, 6, 6]            57,456
│    │    └─Conv2d: 3-24                 [1, 224, 6, 6]            226,016
│    │    └─Conv2d: 3-25                 [1, 24, 6, 6]             12,312
│    │    └─Conv2d: 3-26                 [1, 64, 6, 6]             38,464
│    │    └─MaxPool2d: 3-27              [1, 512, 6, 6]            --
│    │    └─Conv2d: 3-28                 [1, 64, 6, 6]             32,832
│    └─Inception: 2-14                   [1, 512, 6, 6]            --
│    │    └─Conv2d: 3-29                 [1, 128, 6, 6]            65,664
│    │    └─Conv2d: 3-30                 [1, 128, 6, 6]            65,664
│    │    └─Conv2d: 3-31                 [1, 256, 6, 6]            295,168
│    │    └─Conv2d: 3-32                 [1, 24, 6, 6]             12,312
│    │    └─Conv2d: 3-33                 [1, 64, 6, 6]             38,464
│    │    └─MaxPool2d: 3-34              [1, 512, 6, 6]            --
│    │    └─Conv2d: 3-35                 [1, 64, 6, 6]             32,832
│    └─Inception: 2-15                   [1, 528, 6, 6]            --
│    │    └─Conv2d: 3-36                 [1, 112, 6, 6]            57,456
│    │    └─Conv2d: 3-37                 [1, 144, 6, 6]            73,872
│    │    └─Conv2d: 3-38                 [1, 288, 6, 6]            373,536
│    │    └─Conv2d: 3-39                 [1, 32, 6, 6]             16,416
│    │    └─Conv2d: 3-40                 [1, 64, 6, 6]             51,264
│    │    └─MaxPool2d: 3-41              [1, 512, 6, 6]            --
│    │    └─Conv2d: 3-42                 [1, 64, 6, 6]             32,832
│    └─Inception: 2-16                   [1, 832, 6, 6]            --
│    │    └─Conv2d: 3-43                 [1, 256, 6, 6]            135,424
│    │    └─Conv2d: 3-44                 [1, 160, 6, 6]            84,640
│    │    └─Conv2d: 3-45                 [1, 320, 6, 6]            461,120
│    │    └─Conv2d: 3-46                 [1, 32, 6, 6]             16,928
│    │    └─Conv2d: 3-47                 [1, 128, 6, 6]            102,528
│    │    └─MaxPool2d: 3-48              [1, 528, 6, 6]            --
│    │    └─Conv2d: 3-49                 [1, 128, 6, 6]            67,712
│    └─MaxPool2d: 2-17                   [1, 832, 3, 3]            --
├─Sequential: 1-5                        [1, 1024]                 --
│    └─Inception: 2-18                   [1, 832, 3, 3]            --
│    │    └─Conv2d: 3-50                 [1, 256, 3, 3]            213,248
│    │    └─Conv2d: 3-51                 [1, 160, 3, 3]            133,280
│    │    └─Conv2d: 3-52                 [1, 320, 3, 3]            461,120
│    │    └─Conv2d: 3-53                 [1, 32, 3, 3]             26,656
│    │    └─Conv2d: 3-54                 [1, 128, 3, 3]            102,528
│    │    └─MaxPool2d: 3-55              [1, 832, 3, 3]            --
│    │    └─Conv2d: 3-56                 [1, 128, 3, 3]            106,624
│    └─Inception: 2-19                   [1, 1024, 3, 3]           --
│    │    └─Conv2d: 3-57                 [1, 384, 3, 3]            319,872
│    │    └─Conv2d: 3-58                 [1, 192, 3, 3]            159,936
│    │    └─Conv2d: 3-59                 [1, 384, 3, 3]            663,936
│    │    └─Conv2d: 3-60                 [1, 48, 3, 3]             39,984
│    │    └─Conv2d: 3-61                 [1, 128, 3, 3]            153,728
│    │    └─MaxPool2d: 3-62              [1, 832, 3, 3]            --
│    │    └─Conv2d: 3-63                 [1, 128, 3, 3]            106,624
│    └─AdaptiveAvgPool2d: 2-20           [1, 1024, 1, 1]           --
│    └─Flatten: 2-21                     [1, 1024]                 --
├─Linear: 1-6                            [1, 10]                   10,250
==========================================================================================
Total params: 5,977,530
Trainable params: 5,977,530
Non-trainable params: 0
Total mult-adds (M): 276.66
==========================================================================================
Input size (MB): 0.04
Forward/backward pass size (MB): 4.74
Params size (MB): 23.91
Estimated Total Size (MB): 28.69
==========================================================================================
training on cuda:0
18.3 sec, [epoch: 0] train_loss: 1.959, train_acc: 0.252, test_acc: 0.396
