Sequential output shape:	 torch.Size([1, 96, 54, 54])
MaxPool2d output shape:	 torch.Size([1, 96, 26, 26])
Sequential output shape:	 torch.Size([1, 256, 26, 26])
MaxPool2d output shape:	 torch.Size([1, 256, 12, 12])
Sequential output shape:	 torch.Size([1, 384, 12, 12])
MaxPool2d output shape:	 torch.Size([1, 384, 5, 5])
Dropout output shape:	 torch.Size([1, 384, 5, 5])
Sequential output shape:	 torch.Size([1, 10, 5, 5])
AdaptiveAvgPool2d output shape:	 torch.Size([1, 10, 1, 1])
Flatten output shape:	 torch.Size([1, 10])
==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
Sequential                               [1, 10]                   --
├─Sequential: 1-1                        [1, 96, 54, 54]           --
│    └─Conv2d: 2-1                       [1, 96, 54, 54]           11,712
│    └─ReLU: 2-2                         [1, 96, 54, 54]           --
│    └─Conv2d: 2-3                       [1, 96, 54, 54]           9,312
│    └─ReLU: 2-4                         [1, 96, 54, 54]           --
│    └─Conv2d: 2-5                       [1, 96, 54, 54]           9,312
│    └─ReLU: 2-6                         [1, 96, 54, 54]           --
├─MaxPool2d: 1-2                         [1, 96, 26, 26]           --
├─Sequential: 1-3                        [1, 256, 26, 26]          --
│    └─Conv2d: 2-7                       [1, 256, 26, 26]          614,656
│    └─ReLU: 2-8                         [1, 256, 26, 26]          --
│    └─Conv2d: 2-9                       [1, 256, 26, 26]          65,792
│    └─ReLU: 2-10                        [1, 256, 26, 26]          --
│    └─Conv2d: 2-11                      [1, 256, 26, 26]          65,792
│    └─ReLU: 2-12                        [1, 256, 26, 26]          --
├─MaxPool2d: 1-4                         [1, 256, 12, 12]          --
├─Sequential: 1-5                        [1, 384, 12, 12]          --
│    └─Conv2d: 2-13                      [1, 384, 12, 12]          885,120
│    └─ReLU: 2-14                        [1, 384, 12, 12]          --
│    └─Conv2d: 2-15                      [1, 384, 12, 12]          147,840
│    └─ReLU: 2-16                        [1, 384, 12, 12]          --
│    └─Conv2d: 2-17                      [1, 384, 12, 12]          147,840
│    └─ReLU: 2-18                        [1, 384, 12, 12]          --
├─MaxPool2d: 1-6                         [1, 384, 5, 5]            --
├─Dropout: 1-7                           [1, 384, 5, 5]            --
├─Sequential: 1-8                        [1, 10, 5, 5]             --
│    └─Conv2d: 2-19                      [1, 10, 5, 5]             34,570
│    └─ReLU: 2-20                        [1, 10, 5, 5]             --
│    └─Conv2d: 2-21                      [1, 10, 5, 5]             110
│    └─ReLU: 2-22                        [1, 10, 5, 5]             --
│    └─Conv2d: 2-23                      [1, 10, 5, 5]             110
│    └─ReLU: 2-24                        [1, 10, 5, 5]             --
├─AdaptiveAvgPool2d: 1-9                 [1, 10, 1, 1]             --
├─Flatten: 1-10                          [1, 10]                   --
==========================================================================================
Total params: 1,992,166
Trainable params: 1,992,166
Non-trainable params: 0
Total mult-adds (M): 763.82
==========================================================================================
Input size (MB): 0.20
Forward/backward pass size (MB): 12.20
Params size (MB): 7.97
Estimated Total Size (MB): 20.37
==========================================================================================
training on cuda:2
20.7 sec, [epoch: 0] train_loss: 2.208, train_acc: 0.167, test_acc: 0.267
41.1 sec, [epoch: 1] train_loss: 1.410, train_acc: 0.457, test_acc: 0.385
61.5 sec, [epoch: 2] train_loss: 0.883, train_acc: 0.659, test_acc: 0.740
82.1 sec, [epoch: 3] train_loss: 0.715, train_acc: 0.733, test_acc: 0.748
102.6 sec, [epoch: 4] train_loss: 0.631, train_acc: 0.765, test_acc: 0.803
123.2 sec, [epoch: 5] train_loss: 0.508, train_acc: 0.810, test_acc: 0.782
143.8 sec, [epoch: 6] train_loss: 0.452, train_acc: 0.830, test_acc: 0.820
164.6 sec, [epoch: 7] train_loss: 0.410, train_acc: 0.846, test_acc: 0.851
185.3 sec, [epoch: 8] train_loss: 0.386, train_acc: 0.856, test_acc: 0.861
206.0 sec, [epoch: 9] train_loss: 0.366, train_acc: 0.864, test_acc: 0.872
[Total] loss 0.366, train acc 0.864,test acc 0.872
[Total] 206.0 sec, 2912.3 examples/secon cuda:2
