==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
Sequential                               [10, 1]                   --
├─Sequential: 1-1                        [10, 1024]                --
│    └─Linear: 2-1                       [10, 512]                 169,472
│    └─ReLU: 2-2                         [10, 512]                 --
│    └─Linear: 2-3                       [10, 1024]                525,312
│    └─ReLU: 2-4                         [10, 1024]                --
├─DenseBlock: 1-2                        [10, 1280]                --
│    └─Sequential: 2-5                   --                        --
│    │    └─Sequential: 3-1              [10, 128]                 131,456
│    │    └─Sequential: 3-2              [10, 128]                 147,840
├─Sequential: 1-3                        [10, 640]                 --
│    └─Linear: 2-6                       [10, 640]                 819,840
│    └─BatchNorm1d: 2-7                  [10, 640]                 1,280
│    └─ReLU: 2-8                         [10, 640]                 --
├─DenseBlock: 1-4                        [10, 1152]                --
│    └─Sequential: 2-9                   --                        --
│    │    └─Sequential: 3-3              [10, 128]                 82,304
│    │    └─Sequential: 3-4              [10, 128]                 98,688
│    │    └─Sequential: 3-5              [10, 128]                 115,072
│    │    └─Sequential: 3-6              [10, 128]                 131,456
├─Sequential: 1-5                        [10, 576]                 --
│    └─Linear: 2-10                      [10, 576]                 664,128
│    └─BatchNorm1d: 2-11                 [10, 576]                 1,152
│    └─ReLU: 2-12                        [10, 576]                 --
├─DenseBlock: 1-6                        [10, 1088]                --
│    └─Sequential: 2-13                  --                        --
│    │    └─Sequential: 3-7              [10, 128]                 74,112
│    │    └─Sequential: 3-8              [10, 128]                 90,496
│    │    └─Sequential: 3-9              [10, 128]                 106,880
│    │    └─Sequential: 3-10             [10, 128]                 123,264
├─Sequential: 1-7                        [10, 544]                 --
│    └─Linear: 2-14                      [10, 544]                 592,416
│    └─BatchNorm1d: 2-15                 [10, 544]                 1,088
│    └─ReLU: 2-16                        [10, 544]                 --
├─DenseBlock: 1-8                        [10, 800]                 --
│    └─Sequential: 2-17                  --                        --
│    │    └─Sequential: 3-11             [10, 128]                 70,016
│    │    └─Sequential: 3-12             [10, 128]                 86,400
├─BatchNorm1d: 1-9                       [10, 800]                 1,600
├─ReLU: 1-10                             [10, 800]                 --
├─Linear: 1-11                           [10, 1]                   801
==========================================================================================
Total params: 4,035,073
Trainable params: 4,035,073
Non-trainable params: 0
Total mult-adds (M): 40.35
==========================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 0.71
Params size (MB): 16.14
Estimated Total Size (MB): 16.87
==========================================================================================

k, num_epochs, lr, weight_decay, batch_size = (5, 100, 0.1, 0, 128) 

training on cuda:0
11.4 sec
折1，训练log rmse0.068713, 验证log rmse0.120215
11.2 sec
折2，训练log rmse0.046736, 验证log rmse0.112765
11.2 sec
折3，训练log rmse0.039328, 验证log rmse0.066923
11.2 sec
折4，训练log rmse0.033798, 验证log rmse0.073318
11.2 sec
折5，训练log rmse0.038040, 验证log rmse0.051429
5-折验证: 平均训练log rmse: 0.045323, 平均验证log rmse: 0.084930
13.2 sec
训练log rmse：0.031618
