==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
Sequential                               [1, 10]                   --
├─Conv2d: 1-1                            [1, 6, 24, 24]            156
├─BatchNorm2d: 1-2                       [1, 6, 24, 24]            12
├─Sigmoid: 1-3                           [1, 6, 24, 24]            --
├─AvgPool2d: 1-4                         [1, 6, 12, 12]            --
├─Conv2d: 1-5                            [1, 16, 8, 8]             2,416
├─BatchNorm2d: 1-6                       [1, 16, 8, 8]             32
├─Sigmoid: 1-7                           [1, 16, 8, 8]             --
├─AvgPool2d: 1-8                         [1, 16, 4, 4]             --
├─Flatten: 1-9                           [1, 256]                  --
├─Linear: 1-10                           [1, 120]                  30,840
├─BatchNorm1d: 1-11                      [1, 120]                  240
├─Sigmoid: 1-12                          [1, 120]                  --
├─Linear: 1-13                           [1, 84]                   10,164
├─BatchNorm1d: 1-14                      [1, 84]                   168
├─Sigmoid: 1-15                          [1, 84]                   --
├─Linear: 1-16                           [1, 10]                   850
==========================================================================================
Total params: 44,878
Trainable params: 44,878
Non-trainable params: 0
Total mult-adds (M): 0.29
==========================================================================================
Input size (MB): 0.00
Forward/backward pass size (MB): 0.08
Params size (MB): 0.18
Estimated Total Size (MB): 0.26
==========================================================================================
Conv2d output shape:	 torch.Size([1, 6, 24, 24])
BatchNorm2d output shape:	 torch.Size([1, 6, 24, 24])
Sigmoid output shape:	 torch.Size([1, 6, 24, 24])
AvgPool2d output shape:	 torch.Size([1, 6, 12, 12])
Conv2d output shape:	 torch.Size([1, 16, 8, 8])
BatchNorm2d output shape:	 torch.Size([1, 16, 8, 8])
Sigmoid output shape:	 torch.Size([1, 16, 8, 8])
AvgPool2d output shape:	 torch.Size([1, 16, 4, 4])
Flatten output shape:	 torch.Size([1, 256])
Linear output shape:	 torch.Size([1, 120])
